---
kind: other
id: Properties.T:Autodesk.Revit.DB.CurveByPoints
source: html/d28630bb-0f57-230a-c80a-0dbb3d8c7a6d.htm
---
# CurveByPoints Properties

The id of the assembly instance to which the element belongs.